## 自由時報爬蟲

In [1]:
import requests
res = requests.get('http://news.ltn.com.tw/list/breakingnews')
res

In [3]:
#res.text

In [4]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text, 'lxml')

### Example
````
<ul class="list imm">
<li>...</li>
</ul>

````

#### CSS Selector
- http://www.w3school.com.cn/css/css_selector_attribute.asp

In [8]:
#soup.select('ul.list.imm li')
#soup.select('ul.imm li')
#soup.select('.imm li')

In [28]:
newsary = []
for news in soup.select('.imm li'):
    #print(news)
    title = news.select_one('.tit p').text.strip()
    dt    = news.select_one('.tit span').text.strip()
    link  = news.select_one('a.tit').get('href')
    #category = news.select('.tagarea a')
    #tag_ary = []
    #for c in category:
    #    tag_ary.append(c.text)
    category = ','.join([c.text for c in news.select('.tagarea a')])
    
    newsdic = {'title':title, 'dt':dt, 'link':link, 'category':category}
    newsary.append(newsdic)
    #print('==========================')

In [30]:
import pandas
df = pandas.DataFrame(newsary)

In [32]:
df.to_excel('ltn_news.xlsx')

## Numpy

In [33]:
a = [1,2,3,4,5,'S']

In [34]:
b = [2,3,4,5,6,7]

In [35]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [37]:
len(a)

5

In [40]:
res = []
for i in range(0, len(a)):
    res.append(a[i] * b[i])

In [41]:
res

[2, 12, 30, 56, 90]

In [45]:
[a[i] * b[i] for i in range(0, len(a))]

[2, 12, 30, 56, 90]

In [46]:
zip(a,b)

In [48]:
for rec in zip(a,b):
    print(rec)

(1, 2)
(3, 4)
(5, 6)
(7, 8)
(9, 10)

In [49]:
for i,j in zip(a,b):
    print(i,j)

1 2
3 4
5 6
7 8
9 10

In [50]:
for i,j in zip(a,b):
    print(i * j)

2
12
30
56
90

In [51]:
res = []
for i,j in zip(a,b):
    res.append(i * j)
res

[2, 12, 30, 56, 90]

In [52]:
[i * j for i,j in zip(a,b)]

[2, 12, 30, 56, 90]

In [53]:
a

[1, 3, 5, 7, 9]

In [54]:
type(a)

list

In [55]:
import numpy 
na = numpy.array(a)
na

array([1, 3, 5, 7, 9])

In [56]:
type(na)

numpy.ndarray

In [57]:
nb = numpy.array(b)
nb

array([ 2,  4,  6,  8, 10])

In [58]:
nc = na * nb

In [59]:
nc

array([ 2, 12, 30, 56, 90])

In [63]:
na + nb
na - nb
na * nb
na / nb

array([0.5       , 0.75      , 0.83333333, 0.875     , 0.9       ])

In [64]:
import numpy as np
na = np.array([1, 2, 3, 4, 5])
na

array([1, 2, 3, 4, 5])

In [66]:
na[0]

1

In [67]:
na[-1]

5

In [68]:
na[1:3]

array([2, 3])

In [70]:
a
[c for c in a if c >3]

[5, 7, 9]

In [72]:
na > 3

array([False, False, False,  True,  True])

In [73]:
na[na > 3]

array([4, 5])

In [74]:
na = np.array([[1, 2, 3, 4, 5],
[6, 7, 8, 9, 10]])

In [75]:
na

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [76]:
na[0, 0]

1

In [77]:
na[0, :]

array([1, 2, 3, 4, 5])

In [78]:
na[:, 0]

array([1, 6])

In [79]:
na.T

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [80]:
na = np.array([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M',35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [81]:
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U5')

In [82]:
na = np.array([ ['name', 'gender', 'age'],  ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M',35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

In [85]:
import pandas
df = pandas.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M',35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [87]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [88]:
df.columns = ['name', 'gender', 'age']

In [89]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

## Pandas Series

In [90]:
a = [21000, 18900, 18000]
a

[21000, 18900, 18000]

In [91]:
type(a)

list

In [93]:
import numpy as np
na = np.array(a)
na

array([21000, 18900, 18000])

In [95]:
type(na)

numpy.ndarray

In [96]:
import pandas as pd
pa = pd.Series(a)
pa

0    21000
1    18900
2    18000
dtype: int64

In [97]:
type(pa)

pandas.core.series.Series

In [98]:
pa = pd.Series([21000, 18900, 18000], index =
['Iphone', 'Edge S7', 'HTC M1'])

In [99]:
pa

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [100]:
s = pd.Series({'Iphone':21000,'Edge S7':18900,'HTC M1':18000})
s

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [101]:
s[2]

18000

In [103]:
s[1:3]

Edge S7    18900
HTC M1     18000
dtype: int64

In [104]:
s['Iphone']

21000

In [106]:
s[['Iphone', 'Edge S7']]

Iphone     21000
Edge S7    18900
dtype: int64

In [107]:
s

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [108]:
s < 20000

Iphone     False
Edge S7     True
HTC M1      True
dtype: bool

In [109]:
s[s<20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [111]:
s['Iphone'] = 20000

In [112]:
s

Iphone     20000
Edge S7    18900
HTC M1     18000
dtype: int64

In [115]:
s[s< 20000] * 0.8

Edge S7    15120.0
HTC M1     14400.0
dtype: float64

In [116]:
s[s<20000] = s[s< 20000] * 0.8

In [117]:
s

Iphone     20000
Edge S7    15120
HTC M1     14400
dtype: int64

In [120]:
'Iphone' in s

True

In [121]:
'mi' in s

False

In [122]:
s

Iphone     20000
Edge S7    15120
HTC M1     14400
dtype: int64

In [123]:
s * 0.8

Iphone     16000.0
Edge S7    12096.0
HTC M1     11520.0
dtype: float64

In [124]:
np.sqrt(s)

Iphone     141.421356
Edge S7    122.963409
HTC M1     120.000000
dtype: float64

In [125]:
s

Iphone     20000
Edge S7    15120
HTC M1     14400
dtype: int64

In [126]:
s.max()

20000

In [127]:
s.mean()

16506.666666666668

In [128]:
s.describe()

count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [129]:
s[['Iphone', 'HTC M1']]

Iphone    20000
HTC M1    14400
dtype: int64

In [130]:
s[['mi', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:850: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

mi            NaN
HTC M1    14400.0
dtype: float64

In [131]:
s[['Iphone', 'HTC M1']]  + s[['mi', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:850: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

HTC M1    28800.0
Iphone        NaN
mi            NaN
dtype: float64

In [132]:
s2 = s[['Iphone', 'HTC M1']]  + s[['mi', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:850: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

In [134]:
s2.isnull()

HTC M1    False
Iphone     True
mi         True
dtype: bool

In [135]:
s2.notnull()

HTC M1     True
Iphone    False
mi        False
dtype: bool

In [137]:
import math
dic = {'a':59, 'b':70, 'c':80}
[math.sqrt(c) * 10 for c in dic.values()]

[76.81145747868608, 83.66600265340756, 89.44271909999159]

In [139]:
import pandas
dic = {'a':59, 'b':70, 'c':80}
na = pandas.Series(dic)
np.sqrt(na) * 10

a    76.811457
b    83.666003
c    89.442719
dtype: float64

In [140]:
import pandas
ary = [59, 70, 80]
na = np.array(ary)
na

array([59, 70, 80])

In [142]:
for name, garade in zip(['david', 'mary'], [58,99]):
    print(name, garade)

david 58
mary 99

## ZIP 應用案例

In [161]:
import requests
from bs4 import BeautifulSoup
res   = requests.get('https://www.104.com.tw/job/?jobno=6b8zr&jobsource=joblist_a_relevance')
soup  = BeautifulSoup(res.text, 'lxml')
dd = [e.text for e in soup.select('.info')[1].select('.content dl dd')]

In [162]:
dd

['上班族、外籍人士',
 '2年以上',
 '大學以上',
 '不拘',
 '\n英文 -- 聽 /中等、說 /中等、讀 /精通、寫 /中等\n',
 'Linux、Python',
 '系統架構規劃、軟體工程系統開發、軟體品質與保證、軟體整合測試、軟體程式設計',
 '未填寫']

In [163]:
dt = [e.text for e in soup.select('.info')[1].select('.content dl dt')]

In [164]:
dt

['接受身份：', '工作經歷：', '學歷要求：', '科系要求：', '語文條件：', '擅長工具：', '工作技能：', '其他條件：']

In [165]:
a = []
for rec in zip(dt, dd):
    a.append(rec)

In [166]:
a

[('接受身份：', '上班族、外籍人士'),
 ('工作經歷：', '2年以上'),
 ('學歷要求：', '大學以上'),
 ('科系要求：', '不拘'),
 ('語文條件：', '\n英文 -- 聽 /中等、說 /中等、讀 /精通、寫 /中等\n'),
 ('擅長工具：', 'Linux、Python'),
 ('工作技能：', '系統架構規劃、軟體工程系統開發、軟體品質與保證、軟體整合測試、軟體程式設計'),
 ('其他條件：', '未填寫')]

In [160]:
s[1:3:2]

Edge S7    15120
dtype: int64

## Pandas DataFrame

In [167]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F',23], ['tom', 'M', 35], 
                   ['ted', 'M', 33], ['jean', 'F', 21],['lisa', 'F', 20]])

In [168]:
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [169]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [170]:
df.columns = ['name', 'gender', 'age']

In [171]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [172]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29, 50000], ['mary', 'F',23], ['tom', 'M', 35], 
                   ['ted', 'M', 33], ['jean', 'F', 21],['lisa', 'F', 20]])

In [173]:
df

       0  1   2        3
0  frank  M  29  50000.0
1   mary  F  23      NaN
2    tom  M  35      NaN
3    ted  M  33      NaN
4   jean  F  21      NaN
5   lisa  F  20      NaN

In [176]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom','M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]],
columns = ['name', 'gender', 'age'])

In [177]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [178]:
df = pd.DataFrame([
    {'name':'frank','gender':'M', 'age':29}, \
{'name':'mary','gender':'F', 'age':23},      \
{'name':'tom','gender':'M', 'age':35},       \
{'name':'ted','gender':'M', 'age':33},       \
{'name':'jean','gender':'F', 'age':21},      \
{'name':'lisa','gender':'F', 'age':20}])

In [179]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [180]:
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [181]:
?df.head()

In [182]:
df.head(3)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom

In [183]:
df.tail(3)

   age gender  name
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [184]:
print(df)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [185]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
age       6 non-null int64
gender    6 non-null object
name      6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [187]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [188]:
df.dtypes

age        int64
gender    object
name      object
dtype: object

In [190]:
df.iloc[0]

age          29
gender        M
name      frank
Name: 0, dtype: object

In [192]:
df.iloc[1:4]

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted

In [194]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [196]:
df.name

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [195]:
type(df['name'])

pandas.core.series.Series

In [197]:
df[ ['name', 'gender']  ]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

In [201]:
s = [0,1,2,3]
s[:]
s[::]

[0, 1, 2, 3]

In [199]:
df.iloc[1:4]

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted

In [202]:
df.iloc[ 1:4  , :   ]

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted

In [203]:
df.iloc[ 1:4  , 0:2   ]

   age gender
1   23      F
2   35      M
3   33      M

In [204]:
df.iloc[ 1:4  , [0,2]   ]

   age  name
1   23  mary
2   35   tom
3   33   ted

In [208]:
male = df['gender'] == 'M'

In [210]:
df[male]

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [211]:
df[df['gender'] == 'M']

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [213]:
df['age'] > 30

0    False
1    False
2     True
3     True
4    False
5    False
Name: age, dtype: bool

In [214]:
(df['age'] > 30) & (df['gender'] == 'M')

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [215]:
df[(df['age'] > 30) & (df['gender'] == 'M')]

   age gender name
2   35      M  tom
3   33      M  ted

In [216]:
df[(df['age'] > 30) | (df['gender'] == 'M')]

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [226]:
df[~(df['gender'] == 'M')]

   age gender  name
1   23      F  mary
4   21      F  jean
5   20      F  lisa

In [228]:
df['employee'] =True

In [230]:
df

   age gender   name  employee
0   29      M  frank      True
1   23      F   mary      True
2   35      M    tom      True
3   33      M    ted      True
4   21      F   jean      True
5   20      F   lisa      True

In [231]:
del df['employee']

In [232]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [233]:
a = 100

In [234]:
a * 2

200

In [235]:
del a

In [236]:
a * 2

NameError: name 'a' is not defined

In [238]:
df['employee'] = True

In [242]:
df2 = df.drop('employee', axis = 1)

In [244]:
df2

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [245]:
df.drop('employee', axis = 1, inplace=True)

In [246]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [248]:
df.loc[7] = {'name':'qoo', 'gender': 'M', 'age':12}

In [249]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
7   12      M    qoo

In [251]:
df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]))

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
7   12      M    qoo
0   20      F    qoo

In [253]:
df = df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]), ignore_index=True)

In [255]:
df.drop(6)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
7   20      F    qoo

In [256]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   12      M    qoo
7   20      F    qoo

In [257]:
#df = df.drop(6)
df.drop(6, inplace=True)

In [258]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
7   20      F    qoo

In [259]:
df.drop(7, inplace=True)

In [260]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [261]:
df['userid'] = range(101,107)

In [262]:
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106

In [263]:
df.set_index('userid', inplace=True)

In [264]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

In [266]:
df.iloc[0:2,[0,2]]

        age   name
userid
101      29  frank
102      23   mary

In [267]:
df.loc[[101,102]  , ['age', 'name'] ]

        age   name
userid
101      29  frank
102      23   mary